#language: ru
@test
Функционал: тестовый

  @test
  Сценарий: тест
    И Начинаем тест
    И открываем страницу "Главная страница"
    И на странице "Главная страница" нажимаем кнопку "Войти"
    И вводим логин "Логин"
    И вводим пароль "Пароль"
    И авторизуемся "Авторизация"
    И проверяем авторизацию "Ава"
    И выбираем случайную тему "Тема"
    И нажимаем кнопку Ответить "Кнопка ответить"
    И вводим сообщение "Ввод сообщения"
    И отправляем сообщение "Кнопка отправить ответ"
    И переход на вкладку Темы "Вкладка Темы"
    И выбираем случайную тему "Тема"
    И нажимаем кнопку Ответить "Кнопка ответить"
    И вводим сообщение "Ввод сообщения"
    И отправляем сообщение "Кнопка отправить ответ"
